package 형변환개념;

public class 형변환_개념정리 {
// 1. 기본형 형변환 중, 아래 코드를 수정하시오
// int x = 100;
// byte y = x;
// >> byte y =  (byte)x;
	
// 2. 참조형 형변환이 되는 조건은?
// >> 서로 상속관계가 있어야 함
	
// 3. 상속에서 위에 물려주는 클래스를 무엇이라고 하는가?
// >> 부모 클래스
	
// 4. 상속에서 아래에 물려주는 클래스를 무엇이라고 하는가?
// >> 자식 클래스
	
// 6. 기본형 데이터 4가지
// >> 정수, 실수, 문자, 논리
	
// 7. 참조형 데이터 2가지 이상
// >> 문자열, 배열, 컬렉션
	
// 8. 참조형 형변환 중, 아래 코드를 수정하시오
// Car c = new Car();
// Truck t = new Truck();
// Truck은 Car를 상속받아 만들었음
// t = c;
// >> t = (Truck)c;
	
// 9. 기본형, 참조형 변수에 각각 들어있는 것은?
// >> 기본형 - 값
// >> 참조형 - 주소
	
// 10. 참조형 변수를 초기화하려고 할때, 무엇으로 초기화해야 하는가?
// >> null
	
// 11. null이란?
// >> 주소가 없다 --> 주소가 없으면 함수를 부를 수 없음
	
// 12. 포장클래스(랩퍼 클래스)란? + 종류 2가지
// >> 기본형 클래스를 만들어 놓은 것 --> Integer, Double, Boolean
	
// 13. 업 캐스팅이란?
// >> 자동 형변환
	
// 14. 다운 캐스팅이란?
// >> 강제 형변환
}
