package 부품만들기;

public class 부품퀴즈 {
//	1) 변수에 들어가는 데이터의 종류에 따라 2가지로 구분하시오
	//	1. 기본형 변수(정수, 실수, 문자1, 논리)
	//	2. 참조형 변수(배열, 클래스, 객체, 인터페이스)
	
//2) 변수가 선언되는 위치에 따라 2가지로 구분하시오
	//	1. 전역 변수(클래스 아래) 글로벌 변수
	//	2. 지역 변수(클래시 이외) 로컬 변수
	
//3) 클래스와 객체의 관계
		//	클래스 - 틀 / 객체 - 틀을 가지고 만든 실제 부품

//4) 클래스의 인스턴스를 무엇이라고 부르는가?
		//	객체

//5) 필요한 부품을 얻는 방법 3가지
		//1. 이클립스 자체 내장된 4500개 함수 패키지 사용
		//2. 이클립스 마켓플레이스를 이용한 플로그인 설치
		//3. 사용자가 직접 추가

//6) 클래스의 구성요소 2가지
		//1. 멤버 변수 - 클래스 내부에서 선언되는 변수 (클래스의 속성이나 상태)
		//2. 메서드 - 클래스 내부에서 정의되는 함수 (클래스의 동작이나 기능)

//7) 전역 변수와 지역 변수중 자동초기화가 되는 것은?
		//전역변수

//8) int와 String이 자동초기화 되는 경우 무엇이 각각 들어있는가?
		//int -> 0
		//String -> null

//9) 멤버 변수와 멤버 메서드를 구분하시오
		//멤버 변수 - 성질
		//멤버 메서드 - 동작, 함수, 명령어

//10) Car c1 = new Car();
//  	  c1.size = 10;
//  	  c1.price = 1000;인 경우 멤버 변수의 개수, 전체 생성된 변수의 개수와 크기는?

		// 멤버 변수 - 2개(size, price)
		// 전체 생성된 변수의 개수 - c1, size, pirce
		// 변수의 크기 int 4 / int 4 / 함수 4  ==> 12

//11) 참조형 변수를 프린트시 자동호출(사용)되는 메서드 이름은?
		 //  String toString

//12) 참조형 변수를 프린트시 내가 원하는 대로 출력하고 싶은경우 사용하는 메서드 이름은?
		  //  패키지명.클래스명@메모리관리테이블키

//13) 객체 생성시 사용되는 키워드는?
		  //  new
}
